app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    @user.save
---
INSERT INTO "users" ("username", "bio", "city", "zip", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["username", "AndrewSchnieder"], ["bio", "HAIL, tacos"], ["city", "El Cerrito"], ["zip", 94530], ["created_at", "2016-03-18 03:41:50.867791"], ["updated_at", "2016-03-18 03:41:50.867791"]]